<a href="https://colab.research.google.com/github/dongjaks/Pandas_Test/blob/master/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EB%B3%B5%EC%8A%B5re.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import requests
import pandas as pd
from bs4 import BeautifulSoup

In [0]:
#크롤링 목표 url 연결

url = 'https://sports.news.naver.com/kbaseball/record/index.nhn?category=kbo'

site = requests.get(url)

# 목표 site html.parser로 파싱
content = BeautifulSoup(site.content, 'html.parser')

In [0]:
rank = content.select('div.tbl_box tbody#regularTeamRecordList_table tr th')
name = content.select('div.tbl_box tbody#regularTeamRecordList_table tr td.tm span')
check = content.select('div.tbl_box tbody#regularTeamRecordList_table tr td:nth-of-type(2) span')
games=[]
for x in range(0,10):
  next = 2+x*11
  location = 'div.tbl_box tbody#regularTeamRecordList_table tr td:nth-of-type(%s) span' %next
  games.append(int(content.select(location)[0].text)) 
wins=[]
for x in range(0,10):
  next = 3+x*11
  location = 'div.tbl_box tbody#regularTeamRecordList_table tr td:nth-of-type(%s) span' %next
  wins.append(int(content.select(location)[0].text))

In [0]:
ranks =[]
for x in rank:
  ranks.append(int(x.string))

names=[]
for x in name:
  names.append(x.string)

In [0]:
df = pd.DataFrame({'순위':ranks,'구단명':names,'게임수':games,'승리':wins})
df

In [159]:
df.head(5)

   순위 구단명  게임수  승리
0   1  두산  144  88
1   2  SK  144  88
2   3  키움  144  86
3   4  LG  144  79
4   5  NC  144  73

In [160]:
df.columns

Index(['순위', '구단명', '게임수', '승리'], dtype='object')

In [166]:
df.values

array([[1, '두산', 144, 88],
       [2, 'SK', 144, 88],
       [3, '키움', 144, 86],
       [4, 'LG', 144, 79],
       [5, 'NC', 144, 73],
       [6, 'KT', 144, 71],
       [7, 'KIA', 144, 62],
       [8, '삼성', 144, 60],
       [9, '한화', 144, 58],
       [10, '롯데', 144, 48]], dtype=object)

In [167]:
df.describe()

             순위    게임수         승리
count  10.00000   10.0  10.000000
mean    5.50000  144.0  71.300000
std     3.02765    0.0  14.024185
min     1.00000  144.0  48.000000
25%     3.25000  144.0  60.500000
50%     5.50000  144.0  72.000000
75%     7.75000  144.0  84.250000
max    10.00000  144.0  88.000000

In [169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
순위     10 non-null int64
구단명    10 non-null object
게임수    10 non-null int64
승리     10 non-null int64
dtypes: int64(3), object(1)
memory usage: 400.0+ bytes

In [170]:
df['순위']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: 순위, dtype: int64

In [171]:
df['구단명']

0     두산
1     SK
2     키움
3     LG
4     NC
5     KT
6    KIA
7     삼성
8     한화
9     롯데
Name: 구단명, dtype: object

In [173]:
df.sort_values(by='승리', ascending=True)

   순위  구단명  게임수  승리
9  10   롯데  144  48
8   9   한화  144  58
7   8   삼성  144  60
6   7  KIA  144  62
5   6   KT  144  71
4   5   NC  144  73
3   4   LG  144  79
2   3   키움  144  86
0   1   두산  144  88
1   2   SK  144  88

In [175]:
df[5:10]

   순위  구단명  게임수  승리
5   6   KT  144  71
6   7  KIA  144  62
7   8   삼성  144  60
8   9   한화  144  58
9  10   롯데  144  48